app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-06-29 17:48:11.925632"], ["updated_at", "2018-06-29 17:48:11.925632"]]
---
  def create
    @school_class = SchoolClass.create(pass_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-06-29 18:06:54.785436"], ["id", 1]]
---
  def update
    @school_class.update(pass_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_class
    @school_class = SchoolClass.find(params[:id])