app/controllers/students_controller.rb

  def create
    @student = Student.create(pass_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-06-29 17:54:37.421429"], ["updated_at", "2018-06-29 17:54:37.421429"]]

  def update
    find_student
    #binding.pry
    @student.first_name = params[:student][:first_name]
    @student.last_name = params[:student][:last_name]
    @student.save
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-06-29 18:27:38.836151"], ["id", 1]]